Manoharkuduchella/Manohar_BitLearn/Bitlearn_workspace/Microcontrollers/STM32/stm32l4_workspace_LL/I2c_spi_uart/Src/opt3001.c
/*
 * opt3001.c
 *
 *  Created on: May 20, 2026
 *      Author: manohar kuduchella
 */
#include "stm32l476xx.h"
#include "stm32l476xx_i2c_drivers.h"
#include "stm32l476xx_gpio_drivers.h"
#include "opt3001.h"


//WRITE REGISTER
void OPT3001_WriteReg(I2C_Handle_t *pI2CHandle, uint8_t reg, uint16_t value) {
	uint8_t data[3];

	data[0] = reg;

	data[1] = (value >> 8) & 0xFF;
	data[2] = value & 0xFF;

	I2C_MasterSendData(pI2CHandle, data, 3,
	OPT3001_ADDR);
}

//READ REGISTER
uint16_t OPT3001_ReadReg(I2C_Handle_t *pI2CHandle, uint8_t reg) {
	uint8_t rx[2];

	/* Clear flags */
	pI2CHandle->pI2Cx->ICR |=
	I2C_ICR_STOPCF |
	I2C_ICR_NACKCF;

	/* ================= WRITE REGISTER ================= */

	pI2CHandle->pI2Cx->CR2 = 0;

	pI2CHandle->pI2Cx->CR2 |= (OPT3001_ADDR << 1);

	pI2CHandle->pI2Cx->CR2 |= (1 << I2C_CR2_NBYTES_Pos);

	pI2CHandle->pI2Cx->CR2 |= (1 << I2C_CR2_START_Pos);

	while (!(pI2CHandle->pI2Cx->ISR &
	I2C_ISR_TXIS))
		;

	pI2CHandle->pI2Cx->TXDR = reg;

	while (!(pI2CHandle->pI2Cx->ISR &
	I2C_ISR_TC))
		;

	/* ================= REPEATED START READ ================= */

	pI2CHandle->pI2Cx->CR2 = 0;

	pI2CHandle->pI2Cx->CR2 |= (OPT3001_ADDR << 1);

	pI2CHandle->pI2Cx->CR2 |= (1 << I2C_CR2_RD_WRN_Pos);

	pI2CHandle->pI2Cx->CR2 |= (2 << I2C_CR2_NBYTES_Pos);

	pI2CHandle->pI2Cx->CR2 |= (1 << I2C_CR2_AUTOEND_Pos);

	pI2CHandle->pI2Cx->CR2 |= (1 << I2C_CR2_START_Pos);

	/* Read MSB */
	while (!(pI2CHandle->pI2Cx->ISR &
	I2C_ISR_RXNE))
		;

	rx[0] = pI2CHandle->pI2Cx->RXDR;

	/* Read LSB */
	while (!(pI2CHandle->pI2Cx->ISR &
	I2C_ISR_RXNE))
		;

	rx[1] = pI2CHandle->pI2Cx->RXDR;

	/* Wait STOP */
	while (!(pI2CHandle->pI2Cx->ISR &
	I2C_ISR_STOPF))
		;

	/* Clear STOP */
	pI2CHandle->pI2Cx->ICR |=
	I2C_ICR_STOPCF;

	return ((rx[0] << 8) | rx[1]);
}

//SENSOR INIT
void OPT3001_Init(I2C_Handle_t *pI2CHandle) {

	OPT3001_WriteReg(pI2CHandle,
	OPT3001_REG_CONFIG, 0xC410);
}

//READ LUX
int OPT3001_ReadLux(I2C_Handle_t *pI2CHandle) {
	uint16_t raw = 0x0000;
	uint16_t exponent;
	uint16_t mantissa;

	raw = OPT3001_ReadReg(pI2CHandle,
	OPT3001_REG_RESULT);

	exponent = (raw >> 12) & 0x0F;

	mantissa = raw & 0x0FFF;
	int l = mantissa * (0.01 * (1UL << exponent));

	return (int) l;
}
